test.txt
--------------------------------------
Metrics for period to: 19:27:30(+0900) (width: 9.997s)
--------------------------------------

engine.socketio.emit: .......................................................... 5009
engine.socketio.emit_rate: ..................................................... 509/sec
vusers.completed: .............................................................. 1002
vusers.created: ................................................................ 1000
vusers.created_by_name.My sample scenario: ..................................... 1000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 44
  max: ......................................................................... 768
  median: ...................................................................... 85.6
  p95: ......................................................................... 115.6
  p99: ......................................................................... 361.5


--------------------------------------
Metrics for period to: 19:27:40(+0900) (width: 9.987s)
--------------------------------------

engine.socketio.emit: .......................................................... 5000
engine.socketio.emit_rate: ..................................................... 506/sec
vusers.completed: .............................................................. 1000
vusers.created: ................................................................ 1000
vusers.created_by_name.My sample scenario: ..................................... 1000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 60.2
  max: ......................................................................... 147.4
  median: ...................................................................... 83.9
  p95: ......................................................................... 115.6
  p99: ......................................................................... 125.2


--------------------------------------
Metrics for period to: 19:27:50(+0900) (width: 9.986s)
--------------------------------------

engine.socketio.emit: .......................................................... 4986
engine.socketio.emit_rate: ..................................................... 501/sec
vusers.completed: .............................................................. 997
vusers.created: ................................................................ 1000
vusers.created_by_name.My sample scenario: ..................................... 1000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 59.6
  max: ......................................................................... 142.9
  median: ...................................................................... 87.4
  p95: ......................................................................... 111.1
  p99: ......................................................................... 127.8


--------------------------------------
Metrics for period to: 19:28:00(+0900) (width: 9.997s)
--------------------------------------

engine.socketio.emit: .......................................................... 5014
engine.socketio.emit_rate: ..................................................... 510/sec
vusers.completed: .............................................................. 1003
vusers.created: ................................................................ 1000
vusers.created_by_name.My sample scenario: ..................................... 1000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 62.7
  max: ......................................................................... 1116.9
  median: ...................................................................... 92.8
  p95: ......................................................................... 138.4
  p99: ......................................................................... 159.2


Phase completed: unnamed (index: 0, duration: 60s) 19:28:12(+0900)

--------------------------------------
Metrics for period to: 19:28:10(+0900) (width: 9.995s)
--------------------------------------

engine.socketio.emit: .......................................................... 4981
engine.socketio.emit_rate: ..................................................... 503/sec
vusers.completed: .............................................................. 996
vusers.created: ................................................................ 1000
vusers.created_by_name.My sample scenario: ..................................... 1000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 64.7
  max: ......................................................................... 1139.9
  median: ...................................................................... 92.8
  p95: ......................................................................... 135.7
  p99: ......................................................................... 186.8


All VUs finished. Total time: 1 minute, 10 seconds

--------------------------------
Summary report @ 19:28:17(+0900)
--------------------------------

engine.socketio.emit: .......................................................... 30000
engine.socketio.emit_rate: ..................................................... 511/sec
vusers.completed: .............................................................. 6000
vusers.created: ................................................................ 6000
vusers.created_by_name.My sample scenario: ..................................... 6000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 44
  max: ......................................................................... 1139.9
  median: ...................................................................... 90.9
  p95: ......................................................................... 135.7
  p99: ......................................................................... 172.5
Log file: signup-signout/60-to-100

godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)
$ npx artillery run -o signup-signout/60-to-100 signup-signout/signup-signout.yml
Phase started: unnamed (index: 0, duration: 60s) 19:35:39(+0900)

--------------------------------------
Metrics for period to: 19:35:40(+0900) (width: 0.726s)
--------------------------------------

engine.socketio.emit: .......................................................... 32
engine.socketio.emit_rate: ..................................................... 32/sec
vusers.created: ................................................................ 46
vusers.created_by_name.My sample scenario: ..................................... 46


Warning: multiple batches of metrics for period 1668594930000 2022-11-16T10:35:30.000Z
--------------------------------------
Metrics for period to: 19:35:50(+0900) (width: 9.993s)
--------------------------------------

engine.socketio.emit: .......................................................... 675
engine.socketio.emit_rate: ..................................................... 67/sec
errors.Error: xhr poll error: .................................................. 255
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 409
vusers.created_by_name.My sample scenario: ..................................... 409
vusers.failed: ................................................................. 255
vusers.session_length:
  min: ......................................................................... 5093.7
  max: ......................................................................... 5286.6
  median: ...................................................................... 5168
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 591


--------------------------------------
Metrics for period to: 19:36:00(+0900) (width: 9.987s)
--------------------------------------

engine.socketio.emit: .......................................................... 750
engine.socketio.emit_rate: ..................................................... 78/sec
errors.Error: xhr poll error: .................................................. 247
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 347
vusers.created_by_name.My sample scenario: ..................................... 347
vusers.failed: ................................................................. 247
vusers.session_length:
  min: ......................................................................... 5087.2
  max: ......................................................................... 5185.6
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 653


--------------------------------------
Metrics for period to: 19:36:10(+0900) (width: 9.987s)
--------------------------------------

engine.socketio.emit: .......................................................... 870
engine.socketio.emit_rate: ..................................................... 89/sec
errors.Error: xhr poll error: .................................................. 206
vusers.completed: .............................................................. 127
vusers.created: ................................................................ 326
vusers.created_by_name.My sample scenario: ..................................... 326
vusers.failed: ................................................................. 206
vusers.session_length:
  min: ......................................................................... 5091
  max: ......................................................................... 5388.5
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 674


--------------------------------------
Metrics for period to: 19:36:20(+0900) (width: 9.987s)
--------------------------------------

engine.socketio.emit: .......................................................... 806
engine.socketio.emit_rate: ..................................................... 78/sec
errors.Error: xhr poll error: .................................................. 356
vusers.completed: .............................................................. 173
vusers.created: ................................................................ 536
vusers.created_by_name.My sample scenario: ..................................... 536
vusers.failed: ................................................................. 356
vusers.session_length:
  min: ......................................................................... 5086.4
  max: ......................................................................... 5191.7
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 464


--------------------------------------
Metrics for period to: 19:36:30(+0900) (width: 9.996s)
--------------------------------------

engine.socketio.emit: .......................................................... 744
engine.socketio.emit_rate: ..................................................... 77/sec
errors.Error: xhr poll error: .................................................. 260
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 360
vusers.created_by_name.My sample scenario: ..................................... 360
vusers.failed: ................................................................. 260
vusers.session_length:
  min: ......................................................................... 5090.4
  max: ......................................................................... 5196.6
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 640


Phase completed: unnamed (index: 0, duration: 60s) 19:36:39(+0900)

--------------------------------------
Metrics for period to: 19:36:40(+0900) (width: 9.989s)
--------------------------------------

engine.socketio.emit: .......................................................... 852
engine.socketio.emit_rate: ..................................................... 89/sec
errors.Error: xhr poll error: .................................................. 229
vusers.completed: .............................................................. 129
vusers.created: ................................................................ 331
vusers.created_by_name.My sample scenario: ..................................... 331
vusers.failed: ................................................................. 229
vusers.session_length:
  min: ......................................................................... 5088.7
  max: ......................................................................... 5201.8
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 623


All VUs finished. Total time: 1 minute, 10 seconds

--------------------------------
Summary report @ 19:36:43(+0900)
--------------------------------

engine.socketio.emit: .......................................................... 4800
engine.socketio.emit_rate: ..................................................... 73/sec
errors.Error: xhr poll error: .................................................. 1555
vusers.completed: .............................................................. 800
vusers.created: ................................................................ 2355
vusers.created_by_name.My sample scenario: ..................................... 2355
vusers.failed: ................................................................. 1555
vusers.session_length:
  min: ......................................................................... 5086.4
  max: ......................................................................... 5388.5
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 3645
Log file: signup-signout/60-to-100

godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)
$ npx artillery run -o signup-signout/60-to-10 signup-signout/signup-signout.yml


godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)
$ npx artillery run -o signup-signout/60-to-10 signup-signout/signup-signout.yml
Phase started: unnamed (index: 0, duration: 60s) 19:40:02(+0900)

--------------------------------------
Metrics for period to: 19:40:10(+0900) (width: 6.385s)
--------------------------------------

engine.socketio.emit: .......................................................... 62
engine.socketio.emit_rate: ..................................................... 10/sec
errors.Error: xhr poll error: .................................................. 9
errors.xhr poll error: ......................................................... 5
vusers.completed: .............................................................. 5
vusers.created: ................................................................ 21
vusers.created_by_name.My sample scenario: ..................................... 21
vusers.failed: ................................................................. 9
vusers.session_length:
  min: ......................................................................... 5133.6
  max: ......................................................................... 5180.4
  median: ...................................................................... 5168
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 46


--------------------------------------
Metrics for period to: 19:40:20(+0900) (width: 9.938s)
--------------------------------------

engine.socketio.emit: .......................................................... 103
engine.socketio.emit_rate: ..................................................... 10/sec
errors.Error: xhr poll error: .................................................. 14
errors.xhr poll error: ......................................................... 8
vusers.completed: .............................................................. 2
vusers.created: ................................................................ 19
vusers.created_by_name.My sample scenario: ..................................... 19
vusers.failed: ................................................................. 14
vusers.session_length:
  min: ......................................................................... 5110.7
  max: ......................................................................... 5128.8
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 5065.6
vusers.skipped: ................................................................ 81


--------------------------------------
Metrics for period to: 19:40:30(+0900) (width: 9.962s)
--------------------------------------

engine.socketio.emit: .......................................................... 100
engine.socketio.emit_rate: ..................................................... 10/sec
errors.Error: xhr poll error: .................................................. 27
errors.xhr poll error: ......................................................... 17
vusers.completed: .............................................................. 3
vusers.created: ................................................................ 30
vusers.created_by_name.My sample scenario: ..................................... 30
vusers.failed: ................................................................. 27
vusers.session_length:
  min: ......................................................................... 5112.5
  max: ......................................................................... 5129.7
  median: ...................................................................... 5168
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 70


--------------------------------------
Metrics for period to: 19:40:40(+0900) (width: 9.956s)
--------------------------------------

engine.socketio.emit: .......................................................... 97
engine.socketio.emit_rate: ..................................................... 10/sec
errors.Error: xhr poll error: .................................................. 31
errors.xhr poll error: ......................................................... 16
vusers.completed: .............................................................. 4
vusers.created: ................................................................ 32
vusers.created_by_name.My sample scenario: ..................................... 32
vusers.failed: ................................................................. 31
vusers.session_length:
  min: ......................................................................... 5101.5
  max: ......................................................................... 5158
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 68


--------------------------------------
Metrics for period to: 19:40:50(+0900) (width: 9.938s)
--------------------------------------

engine.socketio.emit: .......................................................... 67
engine.socketio.emit_rate: ..................................................... 10/sec
errors.Error: xhr poll error: .................................................. 62
errors.xhr poll error: ......................................................... 10
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 57
vusers.created_by_name.My sample scenario: ..................................... 57
vusers.failed: ................................................................. 62
vusers.session_length:
  min: ......................................................................... 5127.9
  max: ......................................................................... 5127.9
  median: ...................................................................... 5168
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 43


Phase completed: unnamed (index: 0, duration: 60s) 19:41:02(+0900)

--------------------------------------
Metrics for period to: 19:41:00(+0900) (width: 9.955s)
--------------------------------------

engine.socketio.emit: .......................................................... 48
engine.socketio.emit_rate: ..................................................... 15/sec
errors.Error: xhr poll error: .................................................. 91
errors.Error: xhr post error: .................................................. 2
errors.xhr poll error: ......................................................... 14
vusers.created: ................................................................ 93
vusers.created_by_name.My sample scenario: ..................................... 93
vusers.failed: ................................................................. 93
vusers.skipped: ................................................................ 7


All VUs finished. Total time: 1 minute, 10 seconds

--------------------------------
Summary report @ 19:41:07(+0900)
--------------------------------

engine.socketio.emit: .......................................................... 477
engine.socketio.emit_rate: ..................................................... 10/sec
errors.Error: xhr poll error: .................................................. 268
errors.Error: xhr post error: .................................................. 2
errors.xhr poll error: ......................................................... 70
vusers.completed: .............................................................. 15
vusers.created: ................................................................ 285
vusers.created_by_name.My sample scenario: ..................................... 285
vusers.failed: ................................................................. 270
vusers.session_length:
  min: ......................................................................... 5101.5
  max: ......................................................................... 5180.4
  median: ...................................................................... 5168
  p95: ......................................................................... 5168
  p99: ......................................................................... 5168
vusers.skipped: ................................................................ 315
Log file: signup-signout/60-to-10

godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)
$ npx artillery run -o signup-signout/60-to-100 signup-signout/signup-signout.yml


godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)
$ npx artillery run -o signup-signout/60-to-10 signup-signout/signup-signout.yml
Phase started: unnamed (index: 0, duration: 60s) 20:05:02(+0900)

--------------------------------------
Metrics for period to: 20:05:10(+0900) (width: 6.597s)
--------------------------------------

engine.socketio.emit: .......................................................... 50
engine.socketio.emit_rate: ..................................................... 10/sec
errors.Error: xhr poll error: .................................................. 22
vusers.created: ................................................................ 22
vusers.created_by_name.My sample scenario: ..................................... 22
vusers.failed: ................................................................. 22
vusers.skipped: ................................................................ 48


Warning: multiple batches of metrics for period 1668596700000 2022-11-16T11:05:00.000Z
--------------------------------------
Metrics for period to: 20:05:20(+0900) (width: 9.645s)
--------------------------------------

engine.socketio.emit: .......................................................... 73
engine.socketio.emit_rate: ..................................................... 10/sec
errors.Error: xhr poll error: .................................................. 34
errors.xhr poll error: ......................................................... 1
vusers.created: ................................................................ 44
vusers.created_by_name.My sample scenario: ..................................... 44
vusers.failed: ................................................................. 34
vusers.skipped: ................................................................ 56


Warning: multiple batches of metrics for period 1668596710000 2022-11-16T11:05:10.000Z
--------------------------------------
Metrics for period to: 20:05:30(+0900) (width: 9.718s)
--------------------------------------

engine.socketio.emit: .......................................................... 89
engine.socketio.emit_rate: ..................................................... 11/sec
errors.Error: xhr poll error: .................................................. 52
errors.Error: xhr post error: .................................................. 1
errors.xhr poll error: ......................................................... 13
vusers.created: ................................................................ 48
vusers.created_by_name.My sample scenario: ..................................... 48
vusers.failed: ................................................................. 53
vusers.skipped: ................................................................ 52


Warning: multiple batches of metrics for period 1668596720000 2022-11-16T11:05:20.000Z
--------------------------------------
Metrics for period to: 20:05:40(+0900) (width: 9.852s)
--------------------------------------

engine.socketio.emit: .......................................................... 108
engine.socketio.emit_rate: ..................................................... 13/sec
errors.Error: xhr poll error: .................................................. 67
errors.Error: xhr post error: .................................................. 2
errors.xhr poll error: ......................................................... 23
errors.xhr post error: ......................................................... 1
vusers.created: ................................................................ 73
vusers.created_by_name.My sample scenario: ..................................... 73
vusers.failed: ................................................................. 69
vusers.skipped: ................................................................ 27


Warning: multiple batches of metrics for period 1668596730000 2022-11-16T11:05:30.000Z
--------------------------------------
Metrics for period to: 20:05:50(+0900) (width: 9.735s)
--------------------------------------

engine.socketio.emit: .......................................................... 96
engine.socketio.emit_rate: ..................................................... 16/sec
errors.Error: xhr poll error: .................................................. 76
errors.Error: xhr post error: .................................................. 1
errors.xhr poll error: ......................................................... 26
vusers.created: ................................................................ 71
vusers.created_by_name.My sample scenario: ..................................... 71
vusers.failed: ................................................................. 77
vusers.skipped: ................................................................ 29


Phase completed: unnamed (index: 0, duration: 60s) 20:06:02(+0900)

Warning: multiple batches of metrics for period 1668596740000 2022-11-16T11:05:40.000Z
--------------------------------------
Metrics for period to: 20:06:00(+0900) (width: 9.592s)
--------------------------------------

engine.socketio.emit: .......................................................... 37
engine.socketio.emit_rate: ..................................................... 16/sec
errors.Error: xhr poll error: .................................................. 93
errors.xhr poll error: ......................................................... 22
vusers.created: ................................................................ 90
vusers.created_by_name.My sample scenario: ..................................... 90
vusers.failed: ................................................................. 93
vusers.skipped: ................................................................ 10


All VUs finished. Total time: 1 minute, 10 seconds

--------------------------------
Summary report @ 20:06:07(+0900)
--------------------------------

engine.socketio.emit: .......................................................... 453
engine.socketio.emit_rate: ..................................................... 10/sec
errors.Error: xhr poll error: .................................................. 374
errors.Error: xhr post error: .................................................. 4
errors.xhr poll error: ......................................................... 85
errors.xhr post error: ......................................................... 1
vusers.created: ................................................................ 378
vusers.created_by_name.My sample scenario: ..................................... 378
vusers.failed: ................................................................. 378
vusers.skipped: ................................................................ 222
Log file: signup-signout/60-to-10

godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)
$ npx artillery run -o login-fight/login-fight-report login-fight/login-fight.yml


godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)
$ npx artillery run -o login-fight/login-fight-report login-fight/login-fight.yml
Phase started: unnamed (index: 0, duration: 60s) 21:30:44(+0900)

--------------------------------------
Metrics for period to: 21:30:50(+0900) (width: 4.09s)
--------------------------------------

engine.socketio.emit: .......................................................... 21
engine.socketio.emit_rate: ..................................................... 10/sec
vusers.created: ................................................................ 10
vusers.created_by_name.My sample scenario: ..................................... 10
vusers.skipped: ................................................................ 32


Warning: multiple batches of metrics for period 1668601840000 2022-11-16T12:30:40.000Z
--------------------------------------
Metrics for period to: 21:31:00(+0900) (width: 9.939s)
--------------------------------------

engine.socketio.emit: .......................................................... 9
engine.socketio.emit_rate: ..................................................... 9/sec
vusers.skipped: ................................................................ 100


Warning: multiple batches of metrics for period 1668601850000 2022-11-16T12:30:50.000Z
--------------------------------------
Metrics for period to: 21:31:10(+0900) (width: 9.939s)
--------------------------------------

vusers.skipped: ................................................................ 100


Warning: multiple batches of metrics for period 1668601860000 2022-11-16T12:31:00.000Z
--------------------------------------
Metrics for period to: 21:31:20(+0900) (width: 9.939s)
--------------------------------------

vusers.skipped: ................................................................ 100


Warning: multiple batches of metrics for period 1668601870000 2022-11-16T12:31:10.000Z
--------------------------------------
Metrics for period to: 21:31:30(+0900) (width: 9.939s)
--------------------------------------

vusers.skipped: ................................................................ 100


Warning: multiple batches of metrics for period 1668601880000 2022-11-16T12:31:20.000Z
Phase completed: unnamed (index: 0, duration: 60s) 21:31:44(+0900)

--------------------------------------
Metrics for period to: 21:31:40(+0900) (width: 9.939s)
--------------------------------------

vusers.skipped: ................................................................ 100


Warning: multiple batches of metrics for period 1668601890000 2022-11-16T12:31:30.000Z
--------------------------------------
Metrics for period to: 21:31:50(+0900) (width: 9.975s)
--------------------------------------

vusers.completed: .............................................................. 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 64096
  max: ......................................................................... 64096
  median: ...................................................................... 64236
  p95: ......................................................................... 64236
  p99: ......................................................................... 64236
vusers.skipped: ................................................................ 58


All VUs finished. Total time: 1 minute, 15 seconds

--------------------------------
Summary report @ 21:31:53(+0900)
--------------------------------

engine.socketio.emit: .......................................................... 30
engine.socketio.emit_rate: ..................................................... 0/sec
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.My sample scenario: ..................................... 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 64082.8
  max: ......................................................................... 64129.8
  median: ...................................................................... 64236
  p95: ......................................................................... 64236
6                                                                                                                           vusers.skipped: ................................................................ 590
Log file: login-fight/login-fight-report

godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)
$ npx artillery run -o login-fight/login-fight-report login-fight/login-fight.yml
Phase started: unnamed (index: 0, duration: 60s) 21:33:01(+0900)

--------------------------------------
Metrics for period to: 21:33:10(+0900) (width: 7.959s)
--------------------------------------

engine.socketio.emit: .......................................................... 300
engine.socketio.emit_rate: ..................................................... 52/sec
vusers.created: ................................................................ 100
vusers.created_by_name.My sample scenario: ..................................... 100
vusers.skipped: ................................................................ 669


Warning: multiple batches of metrics for period 1668601980000 2022-11-16T12:33:00.000Z
--------------------------------------
Metrics for period to: 21:33:20(+0900) (width: 9.986s)
--------------------------------------

vusers.skipped: ................................................................ 1000


Warning: multiple batches of metrics for period 1668601990000 2022-11-16T12:33:10.000Z
--------------------------------------
Metrics for period to: 21:33:30(+0900) (width: 9.986s)
--------------------------------------

vusers.skipped: ................................................................ 1000


Warning: multiple batches of metrics for period 1668602000000 2022-11-16T12:33:20.000Z
--------------------------------------
Metrics for period to: 21:33:40(+0900) (width: 9.986s)
--------------------------------------

errors.Error: xhr poll error: .................................................. 595
vusers.created: ................................................................ 496
vusers.created_by_name.My sample scenario: ..................................... 496
vusers.failed: ................................................................. 595
vusers.skipped: ................................................................ 504


Warning: multiple batches of metrics for period 1668602010000 2022-11-16T12:33:30.000Z
--------------------------------------
Metrics for period to: 21:33:50(+0900) (width: 9.994s)
--------------------------------------

errors.Error: xhr poll error: .................................................. 1001
vusers.created: ................................................................ 1000
vusers.created_by_name.My sample scenario: ..................................... 1000
vusers.failed: ................................................................. 1001


Phase completed: unnamed (index: 0, duration: 60s) 21:34:01(+0900)

Warning: multiple batches of metrics for period 1668602020000 2022-11-16T12:33:40.000Z
--------------------------------------
Metrics for period to: 21:34:00(+0900) (width: 9.992s)
--------------------------------------

errors.Error: xhr poll error: .................................................. 1000
vusers.created: ................................................................ 1000
vusers.created_by_name.My sample scenario: ..................................... 1000
vusers.failed: ................................................................. 1000


All VUs finished. Total time: 1 minute, 10 seconds

--------------------------------
Summary report @ 21:34:03(+0900)
--------------------------------

engine.socketio.emit: .......................................................... 300
engine.socketio.emit_rate: ..................................................... 11/sec
vusers.failed: ................................................................. 2827

vusers.skipped: ................................................................ 3173

Log file: login-fight/login-fight-report

godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)

$ npx artillery report login-fight/login-fight-report
Report generated: login-fight/login-fight-report.html

$ cd report-viewer/

godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac/report-viewer (main)
$ npm start

> artilleryio-report-viewer@2.1.0 start
> react-scripts start

Browserslist: caniuse-lite is outdated. Please run:
  npx browserslist@latest --update-db
Compiled successfully!

You can now view artilleryio-report-viewer in the browser.

  Local:            http://localhost:3000
  On Your Network:  http://192.168.219.105:3000

Note that the development build is not optimized.
To create a production build, use npm run build.

asset static/js/bundle.js 4.14 MiB [emitted] (name: main) 1 related asset
asset index.html 1.29 KiB [emitted]
asset asset-manifest.json 190 bytes [emitted]
cached modules 3.92 MiB (javascript) 28.3 KiB (runtime) [cached] 275 modules
webpack 5.70.0 compiled successfully in 3571 ms
Files successfully emitted, waiting for typecheck results...
Issues checking in progress...
No issues found.


godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac/report-viewer (main)
$ cd ..

godhy@JangKroed MINGW64 ~/Desktop/sparta_plus/hanghea99/week8/artillery_prac (master)
$ npx artillery run -o test.json test.yml
Phase started: unnamed (index: 0, duration: 60s) 21:54:50(+0900)

--------------------------------------
Metrics for period to: 21:55:00(+0900) (width: 8.37s)
--------------------------------------

http.codes.404: ................................................................ 10
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 21
  max: ......................................................................... 44
  median: ...................................................................... 30.9
  p95: ......................................................................... 41.7
  p99: ......................................................................... 41.7
http.responses: ................................................................ 10
vusers.created: ................................................................ 10
vusers.created_by_name.My sample scenario: ..................................... 10
vusers.skipped: ................................................................ 77


--------------------------------------
Metrics for period to: 21:55:10(+0900) (width: 9.935s)
--------------------------------------

vusers.skipped: ................................................................ 100


Warning: multiple batches of metrics for period 1668603300000 2022-11-16T12:55:00.000Z
--------------------------------------
Metrics for period to: 21:55:20(+0900) (width: 9.936s)
--------------------------------------

vusers.skipped: ................................................................ 100


Warning: multiple batches of metrics for period 1668603310000 2022-11-16T12:55:10.000Z
--------------------------------------
Metrics for period to: 21:55:30(+0900) (width: 9.936s)
--------------------------------------

vusers.skipped: ................................................................ 100


Warning: multiple batches of metrics for period 1668603320000 2022-11-16T12:55:20.000Z
--------------------------------------
Metrics for period to: 21:55:40(+0900) (width: 9.936s)
--------------------------------------

vusers.skipped: ................................................................ 100


Warning: multiple batches of metrics for period 1668603330000 2022-11-16T12:55:30.000Z
Phase completed: unnamed (index: 0, duration: 60s) 21:55:50(+0900)

--------------------------------------
Metrics for period to: 21:55:50(+0900) (width: 9.936s)
--------------------------------------

vusers.skipped: ................................................................ 100


All VUs finished. Total time: 1 minute, 10 seconds

--------------------------------
Summary report @ 21:55:55(+0900)
--------------------------------

http.codes.404: ................................................................ 10
http.request_rate: ............................................................. 0/se

asset static/js/bundle.js 4.14 MiB [emitted] (name: main) 1 related asset
asset index.html 1.29 KiB [emitted]
asset asset-manifest.json 190 bytes [emitted]
cached modules 3.92 MiB (javascript) 28.3 KiB (runtime) [cached] 275 modules
webpack 5.70.0 compiled successfully in 3887 ms
Files successfully emitted, waiting for typecheck results...
Issues checking in progress...
No issues found.